{
  "NAVBAR": {
    "HOME": "Início",
    "ABOUT": "Sobre",
    "PROJECTS": "Projetos",
    "CONTACT": "Contato"
  },
  "LOADING": {
    "TITLE": "Carregando...",
    "MESSAGE": "Espero que não seja por muito tempo 🥹"
  },
  "HOME_PAGE": {
    "TITLE": "Desenvolvedor",
    "STACK_ONE": "Front-End",
    "STACK_TWO": "Back-End",
    "SUMMARY": "Oi 👋🏼.  Eu sou um desenvolvedor que realmente quer fazer uma contribuição sólida e positiva. Espero que goste do meu portfólio."
  },
  "TOOLTIP": {
    "COLOR_MODE": "Intercale entre os modos escuro ou claro",
    "TRANSLATE": "Intercale entre Inglês e Português do Brasil"
  },
  "BUTTON": {
    "READ_MORE": "Quer saber mais?",
    "READ_LESS": "Mostre menos",
    "KNOW_MORE": "Saiba mais",
    "TRANSLATE_SWITCH": "En"
  },
  "ABOUT_PAGE": {
    "TITLE": "Sobre Mim",
    "FIRST_PREVIEW": "Que bom ter você por aqui. Como você pode ver, desde cedo eu já tinha contato com tecnologia. Com a chegada da internet, fiquei deslumbrado com a ideia de poder veicular informações para todos, além da paixão por jogos é claro, quem nesse meio nunca quis criar um?! 😁.",
    "SECOND_PREVIEW": "Sem mais delongas, minha trajetória começou em 2019 um pouco antes da pandemia COVID, onde fiz uma imersão completa, de segunda à segunda, estudando e praticando para me tornar um desenvolvedor full-stack. Iniciei e concluí com êxito o curso da ",
    "THIRD_PREVIEW": "o qual dediquei mais de 1500 horas aperfeiçoando minha habilidades, não só técnicas mas sociais também. Quatro meses antes de me formar, fui contratado como desenvolvedor júnior pela empresa VP6 consultoria. Experienciei em primeira mão o que é trabalhar com grandes nomes desde o começo, prestando serviços para empresas como, Banco Inter, Pif-Paf, Patrimar, ViewCO e entre outras. Graças a isso e ao excelentes tutores que me deram lições importantes, tive um crescimento pessoal e curricular de forma exponencial, o que me garantiu a vaga de desenvolvedor pleno na empresa mais bem conceituada na América Latina, a ",
    "FULL_TEXT_ONE": "Bom, se você chegou até aqui, significa que está curioso por saber um pouco mais sobre mim além de toda essa parte profissional, certo?! Um bom momento para começar é a partir dos meus 12 anos de idade, quando eu ingressei em um grupo de break dance. A importância desse acontecimento se dá para minhas soft-skills em lidar com muitas pessoas e superar desafios. Pode não parecer mas já dancei em palcos para mais de 50 mil pessoas. Me envolvi em diversos projetos sociais, fiz arte (grafite) e liderei pessoas.",
    "FULL_TEXT_TWO": "Quando fiz 17 anos de idade em 2007, comecei a estudar para me tornar piloto de helicópteros. Me formei e trabalhei como mecânico de aeronaves para me envolver mais naquele mundo. Por mais 8 anos, me esforcei para conseguir tirar a brevê de piloto privado e percebi que, somente com meu esforço e minha condição financeira da época, estava desperdiçando meu potencial. Por fim, com todo o dinheiro que juntei até aquele momento, resolvi investir em mim de outra forma e me mudei para o Canadá.",
    "FULL_TEXT_THIRD": "Minha mudança para o Canadá foi muito tranquila graças a gentileza e paciência daqueles que estavam próximos a mim. No 3º mês eu já estava trabalhando e me comunicava bem. Morei por 1 ano e meio em Whistler, na Colúmbia Britânica. Estar sempre aprendendo algo é muito importante para mim e por ser muito dedicado, me destaquei como faxineiro do hotel Aava e fui promovido para o setor de manutenção. Como eu era solteiro, acabei aceitando mais uma promoção e comecei a trabalhar com auditoria no período noturno onde voltei a me envolver com esse mundo tecnológico. Realizava o fechamento do dia e iniciava um novo, além de receber os novos hóspedes que chegavam durante a noite.",
    "FULL_TEXT_FOURTH": "Durante o meu tempo no Canadá, visitei o Brasil algumas vezes e conheci minha esposa. Posso dizer que voltar para o Brasil, foi a melhor decisão que tomei na vida. Com meu retorno, pude acompanhar o nascimento do meu filho e foi nesse ano - 2019 - que conheci o curso da ",
    "FULL_TEXT_END": "Hoje sou muito feliz e realizado. O meu desejo atual é dar à minha família a liberdade e opção de escolha para fazerem o que sempre sonharam, sem toda a preocupação econômica. 😎"
  },
  "SKILLS": {
    "FRONT_TITLE": "Habilidades Front-End",
    "BACK_TITLE": "Habilidades Back-End",
    "OTHERS_TITLE": "Outras Habilidades"
  },
  "PROJECTS_PAGE": {
    "MAIN_TITLE": "Meus 3 Últimos Trabalhos",
    "BUTTON": "Conheça",
    "READ_MORE": "Leia mais",
    "READ_LESS": "Leia menos",
    "FIRST_PROJECTS": {
      "ID": 1,
      "TITLE": "GERANDO FALCÕES",
      "DESCRIPTION": {
        "P1": "Em 2022, a princípio, era para eu ser um desenvolvedor back-end que estaria ali apenas para preencher uma vaga e dar suporte para o app. Era um novo projeto e quando digo 'novo', quero dizer que não só em tempo, mas também em iniciativa global. Para dar contexto, a Accenture, empresa na qual trabalho, promove alguns concursos globais e um deles é o 360° Awards, responsável por eleger a melhor iniciativa que trás consigo valores reais para todos - daí o 360°. O app do grupo Gerando Falcões foi o vencedor em 2023.",
        "P2": "Durante o onboarding (processo inicial de familiarização) identifiquei um problema crítico de cadastros sem identificadores únicos (ids). Posso afirmar que aqui foi meu despertar como desenvolvedor. Ao invés de apresentar uma solução, tive a oportunidade de ter uma reunião diretamente com o cliente e durante essa video-chamada, demostrei a falha e dei opções de escolha para possíveis soluções e, trabalhando em equipe, conseguimos solucionar esse problema. Meus colegas e gerente acabaram me aceitando como tech lead e assim começou minha jornada como um líder versátil e desenvolvedor front-end, back-end e analista de dados.",
        "P3": "Além do que já foi citado, tive duas grandes situações para o app, cada uma em sua área. A primeira, relacionada analise de dados, foi entender uma nova linguagem de programação (R lang) e transpilar o código com mais de 4 mil linhas para cerca de 800 linhas em typescript. O código era responsável por aprender as tendências de respostas familiares à um questionário com aproximadamente 130 perguntas e retornar um índice entre 0.0 e 5.0 pontos referentes ao nível de precariedade daquela família no ambiente social em que ela se situa.",
        "P4": "A segunda, importante para a execução da primeira, foi desenvolver um algorítmo capaz de identificar as perguntas do questionário familiar e em qual categoria cada uma pertencia. Eram oito categorias e nesse cenário, a relação pergunta/categoria era de muitas para muitas (N:M), onde uma pergunta pode pertencer a várias categorias e uma categoria pode pertencer a várias perguntas. Dito isto, o desafio foi apresentar as perguntas uma única vez durante um questionário e, caso uma pergunta já tenha sido respondida em outra categoria, mostrar a resposta daquela pergunta e dar a opção de editá-la ou passar para a próxima pergunta."
      },
      "LINK": "https://gerandofalcoes.com"
    },
    "SECOND_PROJECTS": {
      "ID": 2,
      "TITLE": "SBT VIDEOS",
      "DESCRIPTION": {
        "P1": "Em 2023 também tive a incrível oportunidade de participar do projeto SBT Videos, onde fui responsável por criar um player completamente único para transmissão multimídia onDemand e live stream de um dos maiores sistemas de televisão do país.",
        "P2": "A princípio, seria uma cópia do que o Youtube fornece, mas após a reunião de planejamento com o cliente, ficou definido que eu deveria usar o framework Shaka Player do Google para criar um pacote npm reutilizável. Tive 15 dias para realizar um estudo (spike) e ao 10° dia criar uma POC (prove of concept) para apresentar ao cliente e receber um veredito do que fazer nos 3 meses seguintes. Ps.: pacote npm é quando temos um código para um app ou site e queremos instalar uma feature para usarmos no código, não faria sentido recriar rodas de carros toda vez que montamos um carro, neh?! 😁",
        "P3": "Eu poderia dizer que foi um desafio aprender sobre manifestos e entre outras coisas que podemos encontrar na documentação oficial do Shaka Player, mas minha verdadeira superação foi implementar o sistema de advertisements (ads) em um pacote npm escrito em react e typescript. Para entender um pouco melhor, no react temos que usar um método para referenciar a tag html 'video' e ao fazer isso, qualquer alteração só pode ser testada após lançar uma nova versão daquele pacote. Aqui você consegue acessar uma prévia do código desse pacote.",
        "P4": "Com o término dos 3 meses contratados, recebemos ótimos elogios do cliente e toda essa experiência me tornou uma referência dentro da Accenture Brasil, no quesito video players. Acesse o site oficial do SBT Videos para poder experimentar um pouco do meu trabalho."
      },
      "LINK": "https://www.sbtvideos.com.br"
    },
    "THIRD_PROJECTS": {
      "ID": 3,
      "TITLE": "ARENA MRV - GALO",
      "DESCRIPTION": {
        "P1": "A partir do final de 2023, como um desenvolvedor back-end e um bom background de soft-skills, acabei me tornando a melhor opção para uma equipe sensacional responsável por criar o primeiro super app de um estádio da América do Sul, o 'Super App do Galo'.",
        "P2": "Reconheço que por ter um currículo com crescimento exponencial em aprendizagem e experiência, na minha primeira semana já estava sendo testado. Por termos um prazo apertado, me deram a task de implementar o sistema de pagamento via pix e cartão de crédito de uma pré-reserva de estacionamento. Posso dizer que teve dias que pensei em desistir, no entanto, acredito que quanto maior o desafio a ser superado, maior será a recompensa.",
        "P3": "Em Janeiro de 2024 foi lançado a feature de pagamento via app, sim, segundo o cliente foi um sucesso. Hoje temos mais de 70% dos clientes fazendo pré-reservas ao invés de enfrentar filas e congestionamento para estacionarem seus veículos.",
        "P4": "Eu poderia descrever várias melhorias que eu participei, como gerenciamento de planos premium e sistema de ranqueamento entre torcedores, mas o meu intuito aqui é mostrar que sou, de fato, um profissional responsável e dedicado que se adapta para solucionar cada desafio separadamente conforme a necessidade do projeto."
      },
      "LINK": "https://atletico.com.br/super-app/"
    }
  },
  "CONTACT_PAGE": {
    "TITLE": "Vamos Entrar em Contato",
    "SUB_TITLE": "Por gentileza, preencha o formulário abaixo",
    "SEND_EMAIL": "Enviar",
    "SENDING_EMAIL": "Enviando...",
    "SEND_RESPONSE": "Email enviado com sucesso!",
    "EMAIL_ASPECT": "Aspecto",
    "ERROR_MESSAGE": "Caro usuário, um ou mais campos não foram preenchidos adequadamente!",
    "ERRORS": {
      "TOAST_MESSAGE": "Caro usuário, um ou mais campos não foram preenchidos adequadamente!",
      "FIRST_NAME": "Primeiro nome é obrigatório!",
      "LAST_NAME": "Último nome é obrigatório",
      "PHONE": "Telefone parece estar errado!",
      "EMAIL": "Email parece estar errado!",
      "SUBJECT": "Assunto é obrigatório!",
      "MESSAGE": "Mensagem é obrigatória!",
      "CLOSE": "Fechar"
    },
    "LABELS": {
      "FIRST_NAME": "Primeiro Nome",
      "LAST_NAME": "Último Nome",
      "PHONE": "Telefone",
      "EMAIL": "E-mail",
      "SUBJECT": "Assunto",
      "MESSAGE": "Mensagem"
    },
    "PLACEHOLDERS": {
      "FIRST_NAME": "Carla",
      "LAST_NAME": "Nunes",
      "PHONE": "Opicional",
      "EMAIL": "contato@gmail.com",
      "SUBJECT": "Tente, vamos trabalhar juntos!",
      "MESSAGE": "Por gentileza, escreva sua mensagem aqui..."
    }
  }
}